### 라이브러리 및 데이터 불러오기

In [2]:
import pandas as pd

train = pd.read_csv("train.csv")
test = pd.read_csv("test.csv")

### 탐색적 분석 
- 1. 데이터 샘플 head()
- 2. 데이터 크기 shape()
    - 1) 자료형 info()
    - 2) 기초통계 describe()/수치형
    - 3) 기초 통계 describe(include='object') 범주형
    - 4) 결측치 isnull().sum()
    - 5) 각 target별 빈도수 value_counts()

In [3]:
train.head(3)

,id,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
0,3331,34.0,State-gov,177331,Some-college,10,Married-civ-spouse,Prof-specialty,Husband,Black,Male,4386,0,40.0,United-States,>50K
1,19749,58.0,Private,290661,HS-grad,9,Married-civ-spouse,Craft-repair,Husband,White,Male,0,0,40.0,United-States,<=50K
2,1157,48.0,Private,125933,Some-college,10,Widowed,Exec-managerial,Unmarried,Black,Female,0,1669,38.0,United-States,<=50K

#### 1. 자료형.info()
- float : 2개
- int : 5개
- object : 9개
- 머신러닝의 입력 데이터로 활용하려면 object형을 float,int형처럼 수치형으로 변경해야한다.

In [4]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29304 entries, 0 to 29303
Data columns (total 16 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              29304 non-null  int64
 1   age             29292 non-null  float64
 2   workclass       27642 non-null  object
 3   fnlwgt          29304 non-null  int64
 4   education       29304 non-null  object
 5   education.num   29304 non-null  int64
 6   marital.status  29304 non-null  object
 7   occupation      27636 non-null  object
 8   relationship    29304 non-null  object
 9   race            29304 non-null  object
 10  sex             29304 non-null  object
 11  capital.gain    29304 non-null  int64
 12  capital.loss    29304 non-null  int64
 13  hours.per.week  29291 non-null  float64
 14  native.country  28767 non-null  object
 15  income          29304 non-null  object
dtypes: float64(2), int64(5), object(9)
memory usage: 3.6+ MB

#### 2. 기초 통계 describe()/수치형
- describe()를 활용해 train 데이터와 test데이터의 수치형 컬럼 기초 통계 확인

In [5]:
train.describe()

,id,age,fnlwgt,education.num,capital.gain,capital.loss,hours.per.week
count,29304.000000,29292.000000,2.930400e+04,29304.000000,29304.000000,29304.000000,29291.000000
mean,16264.027880,38.553223,1.897488e+05,10.080842,1093.858722,86.744506,40.434229
std,9384.518323,13.628811,1.055250e+05,2.570824,7477.435640,401.518928,12.324036
min,0.000000,-38.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,8145.750000,28.000000,1.177890e+05,9.000000,0.000000,0.000000,40.000000
50%,16253.500000,37.000000,1.783765e+05,10.000000,0.000000,0.000000,40.000000
75%,24374.250000,48.000000,2.370682e+05,12.000000,0.000000,0.000000,45.000000
max,32560.000000,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [6]:
test.describe()

,id,age,fnlwgt,education.num,capital.gain,capital.loss,hours.per.week
count,3257.000000,3251.000000,3.257000e+03,3257.000000,3257.000000,3257.000000,3248.000000
mean,16423.704943,38.802830,1.900447e+05,10.079214,931.804728,92.336199,40.468288
std,9535.416746,13.917588,1.057902e+05,2.590118,6496.962999,415.732721,12.598546
min,3.000000,17.000000,1.882700e+04,1.000000,0.000000,0.000000,1.000000
25%,8078.000000,28.000000,1.186520e+05,9.000000,0.000000,0.000000,40.000000
50%,16626.000000,37.000000,1.783190e+05,10.000000,0.000000,0.000000,40.000000
75%,24743.000000,48.000000,2.364360e+05,12.000000,0.000000,0.000000,45.000000
max,32559.000000,90.000000,1.033222e+06,16.000000,99999.000000,3900.000000,99.000000

---
- age컬럼의 최솟값 -38
- 나이에는 마이너스가 없음.
---

#### 3. 기초 통계 describe(include='object') / 범주형
- include="O" or include="object"

In [7]:
train.describe(include='O')

,workclass,education,marital.status,occupation,relationship,race,sex,native.country,income
count,27642,29304,29304,27636,29304,29304,29304,28767,29304
unique,8,16,7,14,6,5,2,41,2
top,Private,HS-grad,Married-civ-spouse,Prof-specialty,Husband,White,Male,United-States,<=50K
freq,20451,9449,13466,3683,11845,25022,19578,26240,22263

In [8]:
test.describe(include='O')

,workclass,education,marital.status,occupation,relationship,race,sex,native.country
count,3083,3257,3257,3082,3257,3257,3257,3211
unique,8,16,7,14,6,5,2,37
top,Private,HS-grad,Married-civ-spouse,Prof-specialty,Husband,White,Male,United-States
freq,2245,1052,1510,457,1348,2794,2212,2930

#### 4. 결측치 isnull().sum()
- train 결측치 5개 컬럼 결측치
- test 결측치 3개 컬럼

In [9]:
train.isnull().sum()

id                   0
age                 12
workclass         1662
fnlwgt               0
education            0
education.num        0
marital.status       0
occupation        1668
relationship         0
race                 0
sex                  0
capital.gain         0
capital.loss         0
hours.per.week      13
native.country     537
income               0
dtype: int64

In [10]:
test.isnull().sum()

id                  0
age                 6
workclass         174
fnlwgt              0
education           0
education.num       0
marital.status      0
occupation        175
relationship        0
race                0
sex                 0
capital.gain        0
capital.loss        0
hours.per.week      9
native.country     46
dtype: int64

#### 5. 각 target별 빈도수 value_counts()

- income
- <=50K    22263
- >50K      7041
- Name: count, dtype: int64

In [11]:
train['income'].value_counts()

income
<=50K    22263
>50K      7041
Name: count, dtype: int64

### 데이터 전처리
| 데이터 전처리     | 필수/선택 |
| -------- | --------- |
| 1.결측치 |필수|
| 2.이상치 |선택|
| 3.인코딩 |필수|
| 4.스케일링 |선택|

#### 1. 결측치 처리
- 1) 결측치 삭제
- 2) 결측치 채우기(범주형)
- 3) 결측치 채우기(수치형)

In [12]:
# 1. 결측치 삭제
# dropna()를 통해 결측치가 있는 행 제거
print("처리 전", train.shape)
df = train.dropna()
print("처리 후", df.shape)

처리 전 (29304, 16)
처리 후 (27096, 16)

In [15]:
# 특정 컬럼 데이터에서 결측이 있는 행을 제거할 때
# dropna(subset=['컬럼명'])
df = train.dropna(subset=['native.country','workclass'])
df.isnull().sum()

id                 0
age               12
workclass          0
fnlwgt             0
education          0
education.num      0
marital.status     0
occupation         6
relationship       0
race               0
sex                0
capital.gain       0
capital.loss       0
hours.per.week    13
native.country     0
income             0
dtype: int64

In [ ]:
# 결측치 있는 컬럼 삭제
print("처리 전" , train.shape)
df = train.dropna(axis=1)
print("처리 후" , df.shape)

처리 전 (29304, 16)
처리 후 (29304, 11)

In [17]:
# 특정 컬럼만 삭제
print("처리 전" , train.shape)
df = train.drop(['native.country','workclass'],axis=1)
print("처리 후" , df.shape)

처리 전 (29304, 16)
처리 후 (29304, 14)

#### 결측치 채우기(범주형)
- 범주형 데이터에서 결측치를 채울 때는 주로 최빈값으로 대체
- 특정 컬럼에서 mode()[0]을 통해 최빈값을 찾고, fillna()로 값을 채움

In [20]:
m = train['workclass'].mode()[0]
train['workclass'] = train['workclass'].fillna(m)

m = train['native.country'].mode()[0]
train['native.country'] = train['native.country'].fillna(m)

train.isnull().sum()

id                   0
age                 12
workclass            0
fnlwgt               0
education            0
education.num        0
marital.status       0
occupation        1668
relationship         0
race                 0
sex                  0
capital.gain         0
capital.loss         0
hours.per.week      13
native.country       0
income               0
dtype: int64

In [21]:
train['occupation']  = train['occupation'].fillna('X')
train.isnull().sum()

id                 0
age               12
workclass          0
fnlwgt             0
education          0
education.num      0
marital.status     0
occupation         0
relationship       0
race               0
sex                0
capital.gain       0
capital.loss       0
hours.per.week    13
native.country     0
income             0
dtype: int64

In [22]:
test['workclass'] = test['workclass'].fillna(test['workclass'].mode()[0])
test['native.country'] = test['native.country'].fillna(test['native.country'].mode()[0])
test['occupation'] = test['occupation'].fillna('X')

#### 결측치 채우기(수치형)
- 결측치를 채울 컬럼의 평균값과 중앙값을 각각 Train 데이터에서 구해 Train과 test에 채운다.
- 나이가 소수점으로 채워지지 않도록 int() 함수 사용

In [24]:
value = int(train['age'].mean())

print("평균값: ", value)

train['age'] = train['age'].fillna(value)
test['age'] = test['age'].fillna(value)

평균값:  38